nxp-mcuxpresso/mcux-soc-svd/MCXA286/MCXA286.xml
        <register>
          <name>AIPS_BRIDGE_GROUP2_MEM_RULE5</name>
          <description>AIPS Bridge Group 2 Rule 5</description>
          <addressOffset>0x1B4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x33333333</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LPTMR</name>
              <description>LPTMR</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONSECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Non-secure and non-privilege user access allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONSECURE_PRIV_USER_ALLOWED</name>
                  <description>Non-secure and privilege access allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Secure and non-privilege user access allowed</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_PRIV_USER_ALLOWED</name>
                  <description>Secure and privilege user access allowed</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OSTIMER</name>
              <description>OSTIMER</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONSECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Non-secure and non-privilege user access allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONSECURE_PRIV_USER_ALLOWED</name>
                  <description>Non-secure and privilege access allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Secure and non-privilege user access allowed</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_PRIV_USER_ALLOWED</name>
                  <description>Secure and privilege user access allowed</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WAKE_TIMER</name>
              <description>WAKE_TIMER</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONSECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Non-secure and non-privilege user access allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONSECURE_PRIV_USER_ALLOWED</name>
                  <description>Non-secure and privilege access allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Secure and non-privilege user access allowed</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_PRIV_USER_ALLOWED</name>
                  <description>Secure and privilege user access allowed</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC0</name>
              <description>ADC0</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONSECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Non-secure and non-privilege user access allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONSECURE_PRIV_USER_ALLOWED</name>
                  <description>Non-secure and privilege access allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Secure and non-privilege user access allowed</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_PRIV_USER_ALLOWED</name>
                  <description>Secure and privilege user access allowed</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>AIPS_BRIDGE_GROUP2_MEM_RULE6</name>
          <description>AIPS Bridge Group 2 Rule 6</description>
          <addressOffset>0x1B8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x33333333</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADC1</name>
              <description>ADC1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONSECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Non-secure and non-privilege user access allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONSECURE_PRIV_USER_ALLOWED</name>
                  <description>Non-secure and privilege access allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Secure and non-privilege user access allowed</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_PRIV_USER_ALLOWED</name>
                  <description>Secure and privilege user access allowed</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CMP0</name>
              <description>CMP0</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONSECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Non-secure and non-privilege user access allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONSECURE_PRIV_USER_ALLOWED</name>
                  <description>Non-secure and privilege access allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Secure and non-privilege user access allowed</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_PRIV_USER_ALLOWED</name>
                  <description>Secure and privilege user access allowed</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DAC0</name>
              <description>DAC0</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONSECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Non-secure and non-privilege user access allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONSECURE_PRIV_USER_ALLOWED</name>
                  <description>Non-secure and privilege access allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Secure and non-privilege user access allowed</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_PRIV_USER_ALLOWED</name>
                  <description>Secure and privilege user access allowed</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DAC1</name>
              <description>DAC1</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONSECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Non-secure and non-privilege user access allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONSECURE_PRIV_USER_ALLOWED</name>
                  <description>Non-secure and privilege access allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Secure and non-privilege user access allowed</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_PRIV_USER_ALLOWED</name>
                  <description>Secure and privilege user access allowed</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>AIPS_BRIDGE_GROUP2_MEM_RULE7</name>
          <description>AIPS Bridge Group 2 Rule 7</description>
          <addressOffset>0x1BC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x33333333</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VREF0</name>
              <description>VREF0</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONSECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Non-secure and non-privilege user access allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONSECURE_PRIV_USER_ALLOWED</name>
                  <description>Non-secure and privilege access allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Secure and non-privilege user access allowed</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_PRIV_USER_ALLOWED</name>
                  <description>Secure and privilege user access allowed</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PORT0</name>
              <description>PORT0</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONSECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Non-secure and non-privilege user access allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONSECURE_PRIV_USER_ALLOWED</name>
                  <description>Non-secure and privilege access allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Secure and non-privilege user access allowed</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_PRIV_USER_ALLOWED</name>
                  <description>Secure and privilege user access allowed</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PORT1</name>
              <description>PORT1</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONSECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Non-secure and non-privilege user access allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONSECURE_PRIV_USER_ALLOWED</name>
                  <description>Non-secure and privilege access allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Secure and non-privilege user access allowed</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_PRIV_USER_ALLOWED</name>
                  <description>Secure and privilege user access allowed</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PORT2</name>
              <description>PORT2</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONSECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Non-secure and non-privilege user access allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONSECURE_PRIV_USER_ALLOWED</name>
                  <description>Non-secure and privilege access allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Secure and non-privilege user access allowed</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_PRIV_USER_ALLOWED</name>
                  <description>Secure and privilege user access allowed</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PORT3</name>
              <description>PORT3</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONSECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Non-secure and non-privilege user access allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONSECURE_PRIV_USER_ALLOWED</name>
                  <description>Non-secure and privilege access allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Secure and non-privilege user access allowed</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_PRIV_USER_ALLOWED</name>
                  <description>Secure and privilege user access allowed</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
