nxp-mcuxpresso/mcux-soc-svd/MCXA286/MCXA286.xml
        <register>
          <name>SGI_CTRL</name>
          <description>SGI Control register</description>
          <addressOffset>0xD00</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFDFDFFFF</resetMask>
          <fields>
            <field>
              <name>START</name>
              <description>Start crypto operation</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>no_effect</name>
                  <description>Clr has no effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>start_op</name>
                  <description>Set to start operation</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DECRYPT</name>
              <description>Sets cipher direction (AES)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>enc</name>
                  <description>Encryption</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dec</name>
                  <description>Decryption</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AESKEYSZ</name>
              <description>Sets AES key size</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>aes_128</name>
                  <description>AES-128</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>aes_192</name>
                  <description>AES-192</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>aes_256</name>
                  <description>AES-256</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>rfu</name>
                  <description>RFU (defaults to AES-128)</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CRYPTO_OP</name>
              <description>Sets 'Crypto Operation' type</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>aes</name>
                  <description>AES</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>gfmul</name>
                  <description>GFMUL(If Included)</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sha</name>
                  <description>SHA2 (If Included)</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>cmac</name>
                  <description>CMAC (If Included)</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>others_6</name>
                  <description>others - RFU (Defaults to 1st available OP)</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>others_7</name>
                  <description>others - RFU (Defaults to 1st available OP)</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INSEL</name>
              <description>no description available</description>
              <bitOffset>7</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>datin0</name>
                  <description>DATIN[0]</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>datin1</name>
                  <description>DATIN[1]*</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>datin2</name>
                  <description>DATIN[2]*</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>datin3</name>
                  <description>DATIN[3]*</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>datin0_datout</name>
                  <description>DATIN[0] ^ DATOUT</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>datin1_datout</name>
                  <description>DATIN[1] ^ DATOUT*</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>datin2_datout</name>
                  <description>DATIN[2] ^ DATOUT*</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>datin3_datout</name>
                  <description>DATIN[3] ^ DATOUT*</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>datout</name>
                  <description>DATOUT</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>others_9</name>
                  <description>others - DATIN[0] * - only if DATIN[num] exists, else [0]</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>others_10</name>
                  <description>others - DATIN[0] * - only if DATIN[num] exists, else [0]</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>others_11</name>
                  <description>others - DATIN[0] * - only if DATIN[num] exists, else [0]</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>others_12</name>
                  <description>others - DATIN[0] * - only if DATIN[num] exists, else [0]</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>others_13</name>
                  <description>others - DATIN[0] * - only if DATIN[num] exists, else [0]</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>others_14</name>
                  <description>others - DATIN[0] * - only if DATIN[num] exists, else [0]</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>others_15</name>
                  <description>others - DATIN[0] * - only if DATIN[num] exists, else [0]</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OUTSEL</name>
              <description>no description available</description>
              <bitOffset>11</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>datout_ker_res</name>
                  <description>DATOUT = 'Kernel Res'</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>datout_datin0</name>
                  <description>DATOUT = 'Kernel Res' ^ DATIN[0]</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>datout_datin1</name>
                  <description>DATOUT = 'Kernel Res' ^ DATIN[1]*</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>datout_datin2</name>
                  <description>DATOUT = 'Kernel Res' ^ DATIN[2]*</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>datout_datin3</name>
                  <description>DATOUT = 'Kernel Res' ^DATIN[3]*</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>others_5</name>
                  <description>others - DATOUT = 'Kernel Res' * - only if DATIN[num] exists, else [0]</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>others_6</name>
                  <description>others - DATOUT = 'Kernel Res' * - only if DATIN[num] exists, else [0]</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>others_7</name>
                  <description>others - DATOUT = 'Kernel Res' * - only if DATIN[num] exists, else [0]</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DATOUT_RES</name>
              <description>Kernels data out options</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>end_up</name>
                  <description>END_UP</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>start_up</name>
                  <description>START_UP</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>trigger_up</name>
                  <description>TRIGGER_UP</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>no_up</name>
                  <description>NO_UP</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AES_EN</name>
              <description>AES Kernel Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disable</name>
                  <description>AES disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enable</name>
                  <description>AES enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GCM_EN</name>
              <description>GFMUL Kernel Enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disable</name>
                  <description>GFMUL disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enable</name>
                  <description>GFMUL enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRNG_EN</name>
              <description>PRNG Enable (only if SGI has internal PRNG)</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disable</name>
                  <description>PRNG Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enable</name>
                  <description>PRNG Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INKEYSEL</name>
              <description>Input key selection</description>
              <bitOffset>20</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AES_NO_KL</name>
              <description>AES No decryption key schedule</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>new</name>
                  <description>new AES key will be loaded</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>no</name>
                  <description>No AES key will be loaded, and previously loaded key will be used.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AES_SEL</name>
              <description>AES Dual Selection</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>first_aes</name>
                  <description>First AES selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>second_aes</name>
                  <description>Second AES selected (when enabled)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
